# CURE Project - Deliverable 1
## Mathias Bathe - UCID 10183560

## TASK 1: GAINING A BASIC UNDERSTANDING OF PANDAS DATAFRAME
## a)
- Create a variable called 'emissions' and assign to it the following data in Table 1 as a pandas DataFrame
- Create an excel file 'emissions_from_pandas.xlsx' from the 'emissions' variable using python

In [24]:
import pandas as pd

# Given Data from Table 1
low_altitude = [1.50, 1.48, 2.98, 1.40, 3.12, 0.25, 6.73, 5.30, 9.30, 6.96, 7.21, 0.87, 1.06, 7.39, 1.37]
high_altitude = [7.59, 2.06, 8.86, 8.67, 5.61, 6.28, 4.04, 4.40, 9.52, 1.50, 6.07, 17.11, 3.57, 2.68, 6.46]
data = {"Low Altitude": low_altitude, "High Altitude": high_altitude} #dictionary for given data

# Create a table using pandas (DataFrame)
emissions = pd.DataFrame(data)

# Save to excel
emissions.to_excel("emissions_from_pandas.xlsx", index=False) # index=False to remove row numbers

## b)
- Run the given commands and show the outputs of the DataFrame using the .iloc[] method

In [25]:
emissions.head()

   Low Altitude  High Altitude
0          1.50           7.59
1          1.48           2.06
2          2.98           8.86
3          1.40           8.67
4          3.12           5.61

In [26]:
emissions.iloc[0,0]

1.5

In [27]:
emissions.iloc[1,1]

2.06

In [28]:
emissions.iloc[0:2,0:2]

   Low Altitude  High Altitude
0          1.50           7.59
1          1.48           2.06

In [29]:
emissions.iloc[2:4,:]

   Low Altitude  High Altitude
2          2.98           8.86
3          1.40           8.67

## c)
- Create an xl file 'emissions_from_pandas.xlsx' from the emissions variable using the .to_excel method
- Paste the screenshot of the input command

In [30]:
# Create xl File
emissions.to_excel("emissions_from_pandas.xlsx", index=False) # index=False to remove row numbers

## d)
- Create an MS Excel file 'emissions_excel.xlsx' containing the data in Table 1 above with the column header and save it on your computer.
- Create a variable 'emissions_from_excel’ from the ‘emissions_excel.xlsx’ file using pd_read function
- Show the first five rows using .head()
- Paste a screenshot with the input commands used

In [31]:
# Create MS Excel File with given data
emissions.to_excel("emissions_excel.xlsx", index=False)

In [32]:
# Read data back from excel
emissions_from_excel = pd.read_excel("emissions_excel.xlsx")

In [33]:
# Show first 5 rows
emissions_from_excel.head()

   Low Altitude  High Altitude
0          1.50           7.59
1          1.48           2.06
2          2.98           8.86
3          1.40           8.67
4          3.12           5.61

## TASK 2: NUMERICAL AND GRAPHICAL SUMMARY OF DATASETS USING PYTHON AND PANDAS

# a)

- Use pandas to show the stats for the emissions data, both at low and high altitude
- Show the count, sample mean, sample std, min, max, median, first and third quartile

In [34]:
emissions.describe()

       Low Altitude  High Altitude
count     15.000000      15.000000
mean       3.794667       6.294667
std        3.020801       3.890521
min        0.250000       1.500000
25%        1.385000       3.805000
50%        2.980000       6.070000
75%        6.845000       8.130000
max        9.300000      17.110000

# b)

- Use pandas to generate a comparative boxplot of the emissions dataset
- Interpret the boxplot (max 50 words)

In [50]:
emissions.boxplot().set_ylabel('Emissions (g/gal)')

Text(0, 0.5, 'Emissions (g/gal)')

## Interpretation HERE 
## ALSO MAKE SURE BOXPLOT SHOWS ABOVE

# c)

- Use Excel to compute the stats in part a)
- Draw the comparative boxplot in part b) (by hand?)

## TASK 3: IMPORTANCE OF GRAPHS

- Given two bivariate datasets

# a) 
- Define a variable ''dataset1' of type dataframe using the bivariate dataset I given
- Find the summary stats using dataset1.describe()

In [4]:
import pandas as pd

x = [10, 8, 13, 9, 11, 14, 6, 4, 12, 7, 5] # x is same for both datasets
y_dataset1 = [8.04, 6.95, 7.58, 8.81, 8.33, 9.96, 7.24, 4.26, 10.84, 4.82, 5.68]
dataset1_dic = {"x": x, "y": y_dataset1}
dataset1 = pd.DataFrame(dataset1_dic)

dataset1.describe()

               x          y
count  11.000000  11.000000
mean    9.000000   7.500909
std     3.316625   2.031568
min     4.000000   4.260000
25%     6.500000   6.315000
50%     9.000000   7.580000
75%    11.500000   8.570000
max    14.000000  10.840000

In [6]:
# x is same for both datasets, and it was defined before
y_dataset2 = [9.14, 8.14, 8.74, 8.77, 9.26, 8.10, 6.13, 3.10, 9.13, 7.26, 4.74]
dataset2_dic = {"x": x, "y": y_dataset2}
dataset2 = pd.DataFrame(dataset2_dic)

dataset2.describe()

               x          y
count  11.000000  11.000000
mean    9.000000   7.500909
std     3.316625   2.031657
min     4.000000   3.100000
25%     6.500000   6.695000
50%     9.000000   8.140000
75%    11.500000   8.950000
max    14.000000   9.260000

# c)

- Do you see any difference between the stats that summarize the y variables in the two datasets?

Answer: Yes, there is a difference in several summary statistics. There are also similarities. The count and mean are the same for both datasets, and the std is nearly the same for both datasets. Meanwhile, the min, 25%, 50%, 75%, and max are different for each dataset.

# d)
- Draw (not sure if draw by hand or in code) a diagram showing two scatterplots using the same axes to display dataset1 and dataset2
- Do you see any difference between the two datasets? Comment (less than 50 words)